Revit 2027 API
ParameterMap.Item Property
Gets or sets an item at a specified key within the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual Parameter this[
	string key
] { get; set; }
Public Overridable Property Item (
	key As String
) As Parameter
	Get
	Set
public:
virtual property Parameter^ Item[String^ key] {
	Parameter^ get (String^ key);
	void set (String^ key, Parameter^ value);
}
abstract Item : Parameter with get, set
override Item : Parameter with get, set
Parameters
key String
The key of the item to be set or retrieved.
Return Value
Parameter
Returns the object at the specified key.
See Also
Reference
ParameterMap Class
Autodesk.Revit.DB Namespace